import "./chunk-WDMUDEB6.js";

// node_modules/@angular/common/locales/he.js
var u = void 0;
function plural(val) {
  const n = val, i = Math.floor(Math.abs(val)), v = val.toString().replace(/^[^.]*\.?/, "").length;
  if (i === 1 && v === 0 || i === 0 && !(v === 0))
    return 1;
  if (i === 2 && v === 0)
    return 2;
  return 5;
}
var he_default = ["he", [["AM", "PM"]], [["לפנה״צ", "אחה״צ"], ["AM", "PM"]], [["א׳", "ב׳", "ג׳", "ד׳", "ה׳", "ו׳", "ש׳"], ["יום א׳", "יום ב׳", "יום ג׳", "יום ד׳", "יום ה׳", "יום ו׳", "שבת"], ["יום ראשון", "יום שני", "יום שלישי", "יום רביעי", "יום חמישי", "יום שישי", "יום שבת"], ["א׳", "ב׳", "ג׳", "ד׳", "ה׳", "ו׳", "ש׳"]], u, [["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["ינו׳", "פבר׳", "מרץ", "אפר׳", "מאי", "יוני", "יולי", "אוג׳", "ספט׳", "אוק׳", "נוב׳", "דצמ׳"], ["ינואר", "פברואר", "מרץ", "אפריל", "מאי", "יוני", "יולי", "אוגוסט", "ספטמבר", "אוקטובר", "נובמבר", "דצמבר"]], u, [["לפני", "אחריי"], ["לפנה״ס", "לספירה"], ["לפני הספירה", "לספירה"]], 0, [5, 6], ["d.M.y", "d בMMM y", "d בMMMM y", "EEEE, d בMMMM y"], ["H:mm", "H:mm:ss", "H:mm:ss z", "H:mm:ss zzzz"], ["{1}, {0}", u, u, u], [".", ",", ";", "%", "‎+", "‎-", "E", "×", "‰", "∞", "NaN", ":"], ["#,##0.###", "#,##0%", "‏#,##0.00 ‏¤;‏-#,##0.00 ‏¤", "#E0"], "ILS", "₪", "שקל חדש", { "BYN": [u, "р"], "CNY": ["‎CN¥‎", "¥"], "ILP": ["ל״י"], "PHP": [u, "₱"], "THB": ["฿"], "TWD": ["NT$"] }, "rtl", plural];
export {
  he_default as default
};
//# sourceMappingURL=@angular_common_locales_he.js.map
